app/controllers/registers_controller.rb

  def index
    @registers = Register.all
---
SELECT "registers".* FROM "registers"

  def create
    @register = Register.new(register_params)
    @registers = Register.all
    respond_to do |format|
      if recaptcha_valid?

        @database = @registers.where(email:@register.email).take
        if @database.nil?
          @register.save!
---
INSERT INTO "registers" ("name", "lastName", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Samuel"], ["lastName", "Yoo"], ["email", "green.life93@gmail.com"], ["created_at", 2017-03-09 20:59:20 UTC], ["updated_at", 2017-03-09 20:59:20 UTC]]

  def destroy
    @register.destroy
---
DELETE FROM "registers" WHERE "registers"."id" = ?  [["id", 1]]

    def set_register
      @register = Register.find(params[:id])
---
SELECT  "registers".* FROM "registers" WHERE "registers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]